scc2425-tukano/src/main/test/Artillery_Tests/last_Delete.yaml
config:                                                                         
    target: https://scc-70526-70527.azurewebsites.net/rest                                      
    phases:                                                                     
        - name: simple_delete                                                     
          duration: 10                                                      
          arrivalCount: 67                                                    
    payload:                                                                    
        path: ./data/users.csv                                                  
        order: sequence # selects users sequentially, default is random         
        #loadAll: true # load the whole CSV  
        skipHeader: true # The first line is a header, so we want to skip it    
        delimiter: "," # standard delimiter                                     
        skipEmptyLines: true # not important in our case                        
        fields:                                                                 
            - "id"                                                          
            - "pwd"                                                             
            - "email"                                                           
            - "displayName"

scenarios:                                                                      
    - name: TuKanoRegister                                                      
      flow:
        - delete:                                                                 
            url: /users/{{ id }}?pwd={{ pwd }}
            headers:                                                            
                Accept: application/json