scc2425-tukano/src/main/test/Artillery_Tests/like_n_getLikes.yaml
config:
  target: https://scc-70526-70527.azurewebsites.net/rest/
  phases:
    - name: like_n_getLikes
      duration: 1 
      arrivalRate: 1 

scenarios:
  - name: TuKanoHome
    flow:
      - post:
          url: /shorts/kgallagher2?pwd=securepasswordlol
          capture: 
            json: '$'  
            as: 'response'

      - post:
          url: /shorts/{{ response.shortId }}/Cambio/likes?isLiked=true&pwd=easypass

      - get:
          url: /shorts/{{ response.shortId }}/likes?pwd=securepasswordlol
          capture:
            json: '$'
            as: 'LikesResponse'

      - log: "Likes of {{ response.shortId}} : {{ LikesResponse }}"